src/cf/DataProcessors/мрРасчетСреднегоЧекаПоПродавцам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<DataProcessor>
		<Properties>
			<Name>мрРасчетСреднегоЧекаПоПродавцам</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоБлоковШагаМАП</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоБлоковШагаШафл</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/cf/InformationRegisters/мзРезультаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<InformationRegister>
		<Properties>
			<Name>мзРезультаты</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Результат1</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Результат2</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Результат3</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Ключ</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КлючДанных</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Documents/Продажи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Document>
		<Properties>
			<Name>Продажи</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.мрДанные</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Город</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Города</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Продавец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Продавцы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Состав</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Товар</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Товар</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/Catalogs/мрРезультатРаботыШагаМАП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Catalog>
		<Properties>
			<Name>мрРезультатРаботыШагаМАП</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Ключ</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КлючДанных</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/мрСортированныеДанные.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Catalog>
		<Properties>
			<Name>мрСортированныеДанные</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Ключ</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КлючДанных</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Данные</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/DataProcessors/мрРасчетСреднегоЧекаПоПродавцам/Ext/ManagerModule.bsl
#Область ПрограммныйИнтерфейс
 
Процедура ПодготовитьОкружение() Экспорт
	
	НЗ = РегистрыСведений.мзРезультаты.СоздатьНаборЗаписей();
	НЗ.Записать();

	СправочникПометитьНаУдаление("мрСортированныеДанные");
	СправочникПометитьНаУдаление("мрРезультатРаботыШагаМАП");
	
	СчетчикБлоков = 0;
	СчетчикБлоковСорт = 0;	
	
КонецПроцедуры

Процедура Map(Параметры) Экспорт 
	
	ТаблицаДанных = Новый ТаблицаЗначений;
	ТаблицаДанных.Колонки.Добавить("Регистратор", Новый ОписаниеТипов("ДокументСсылка.Продажи"));
	ТаблицаДанных.Колонки.Добавить("Сумма", Новый ОписаниеТипов("Число"));
	ТаблицаДанных.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число"));
	
	Для каждого Элемент Из Параметры.Данные Цикл
		СтрокаДанных = ТаблицаДанных.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаДанных, Элемент);
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаблицаДанных.Регистратор КАК Регистратор,
		|	ТаблицаДанных.Сумма КАК Сумма,
		|	ТаблицаДанных.Количество КАК Количество
		|ПОМЕСТИТЬ ВТ_Данные
		|ИЗ
		|	&ТаблицаДанных КАК ТаблицаДанных
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Данные.Сумма КАК Сумма,
		|	Продажи.Продавец КАК Продавец,
		|	ВТ_Данные.Количество КАК Количество
		|ИЗ
		|	ВТ_Данные КАК ВТ_Данные
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Продажи КАК Продажи
		|		ПО ВТ_Данные.Регистратор = Продажи.Ссылка";
	
	Запрос.УстановитьПараметр("ТаблицаДанных", ТаблицаДанных);
	РезультатЗапроса = Запрос.Выполнить();
	                      
	Выборка = РезультатЗапроса.Выбрать();
	ВыходныеДанные = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		Результат = Справочники.мрРезультатРаботыШагаМАП.СоздатьЭлемент();		
		ЗаполнитьЗначенияСвойств(Результат, Выборка);
		Результат.Ключ = Выборка.Продавец;
		Результат.Записать();
	КонецЦикла;
	
КонецПроцедуры

Процедура Shuffle(Параметры = Неопределено) Экспорт
			
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	мрРезультатРаботыШагаМАП.Ключ КАК Ключ,
		|	мрРезультатРаботыШагаМАП.Сумма КАК Сумма,
		|	мрРезультатРаботыШагаМАП.Количество КАК Количество
		|ИЗ
		|	Справочник.мрРезультатРаботыШагаМАП КАК мрРезультатРаботыШагаМАП
		|ГДЕ
		|	НЕ мрРезультатРаботыШагаМАП.ПометкаУдаления
		|ИТОГИ ПО
		|	Ключ";
	
	РезультатЗапроса = Запрос.Выполнить();	
	ВыборкаКлюч = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаКлюч.Следующий() Цикл
		
		КлючДанных = Справочники.мрСортированныеДанные.СоздатьЭлемент();
		КлючДанных.Ключ = ВыборкаКлюч.Ключ;
	
		ВыборкаДетальныеЗаписи = ВыборкаКлюч.Выбрать();
	
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			НоваяСтрока = КлючДанных.Данные.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
		КонецЦикла;
		КлючДанных.Записать();
		
	КонецЦикла;
		
КонецПроцедуры

Процедура Reduce(Параметры) Экспорт 
	
	ОбщаяСумма = 0;
	ОбщееКоличество = 0;
	
	Для каждого Значение Из Параметры.Данные Цикл

		ОбщаяСумма = ОбщаяСумма + Значение.Сумма;
		ОбщееКоличество = ОбщееКоличество + Значение.Количество;
	КонецЦикла;
	
	ОбщееКоличество = ?(ОбщееКоличество = 0, 1, ОбщееКоличество);
	Среднее = ОбщаяСумма / ОбщееКоличество;
	
	МЗ = РегистрыСведений.мзРезультаты.СоздатьМенеджерЗаписи();
	МЗ.Ключ = Параметры.Ключ;
	МЗ.Результат1 = Среднее;
	МЗ.Записать();
	
КонецПроцедуры

#КонецОбласти

#Область Служебные

Функция ПолучитьРезультатЭтапаМап()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	мрРезультатРаботыШагаМАП.Ключ КАК Ключ,
		|	мрРезультатРаботыШагаМАП.Сумма КАК Сумма,
		|	мрРезультатРаботыШагаМАП.Количество КАК Количество
		|ИЗ
		|	Справочник.мрРезультатРаботыШагаМАП КАК мрРезультатРаботыШагаМАП
		|ГДЕ
		|	НЕ мрРезультатРаботыШагаМАП.ПометкаУдаления
		|ИТОГИ ПО
		|	Ключ";
	
	РезультатЗапроса = Запрос.Выполнить();
	Возврат РезультатЗапроса;

КонецФункции

Процедура СправочникПометитьНаУдаление(Имя)
		
	Запрос = Новый Запрос;
	Текст = 
	"ВЫБРАТЬ
	|	СПР.Ссылка
	|ИЗ
	|	Справочник.%1 КАК СПР
	|ГДЕ
	|	НЕ СПР.ПометкаУдаления";
	
	Запрос.Текст = СтрШаблон(Текст, Имя);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Объект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		Объект.УстановитьПометкуУдаления(Истина);
	КонецЦикла;

КонецПроцедуры


#КонецОбласти
